CSI API ETABS v1

# cDCoTS_500_2000 Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cDCoTS_500_2000

    Public Interface cDCoTS_500_2000

    Dim instance As cDCoTS_500_2000

    public interface class cDCoTS_500_2000

    type cDCoTS_500_2000 =  interface end

The cDCoTS_500_2000 type exposes the following members.

Methods

| Name| Description
---|---|---
|
GetOverwrite|
|
GetPreference|
|
SetOverwrite|
|
SetPreference|
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com